Revit 2024 API
FlexPipe.FlowState Property
The flow state of the pipe.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public PipeFlowState FlowState { get; }
Visual Basic
Public ReadOnly Property FlowState As PipeFlowState
	Get
Visual C++
public:
property PipeFlowState FlowState {
	PipeFlowState get ();
}
See Also
FlexPipe Class
Autodesk.Revit.DB.Plumbing Namespace